Homework-ETL-Ardhani Rahmadianto

## Web Scraping

In [1]:
import pandas as pd
import logging

logging.basicConfig(level=logging.INFO)

In [2]:
url =  "https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes"

In [3]:
def scrape(url):
  logging.info(f"Scraping website with url: '{url}' ...")
  return pd.read_html(url, header=None)

In [4]:
dfs = scrape(url)[1] # --> table ke 2 yang ingin kita ambil (tahun 2021)

INFO:root:Scraping website with url: 'https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes' ...

In [5]:
dfs

,No.,Nama,Kekayaan bersih (USD),Usia,Kebangsaan,Sumber kekayaan
0,NaN,Jeff Bezos,$177 miliar,57,Amerika Serikat,Amazon
1,NaN,Elon Musk,$151 miliar,49,Amerika Serikat,"Tesla, SpaceX"
2,NaN,Bernard Arnault & keluarga,$150 miliar,72,Prancis,LVMH
3,NaN,Bill Gates,$124 miliar,65,Amerika Serikat,Microsoft
4,NaN,Mark Zuckerberg,$97 miliar,36,Amerika Serikat,Meta Platforms
5,NaN,Warren Buffett,$96 miliar,90,Amerika Serikat,Berkshire Hathaway
6,NaN,Larry Ellison,$93 miliar,76,Amerika Serikat,Oracle Corporation
7,NaN,Larry Page,$91.5 miliar,48,Amerika Serikat,Alphabet Inc.
8,NaN,Sergey Brin,$89 miliar,47,Amerika Serikat,Alphabet Inc.
9,NaN,Mukesh Ambani,$84.5 miliar,63,India,Reliance Industries

# Cleaning Data

Pada data diatas terdapat urutan nomor NaN -- ini harus juga dibersihkan

In [6]:
import numpy as np

dfs['No.'] = np.arange(start = 1,stop = len(dfs) + 1,step=1) 
dfs

,No.,Nama,Kekayaan bersih (USD),Usia,Kebangsaan,Sumber kekayaan
0,1,Jeff Bezos,$177 miliar,57,Amerika Serikat,Amazon
1,2,Elon Musk,$151 miliar,49,Amerika Serikat,"Tesla, SpaceX"
2,3,Bernard Arnault & keluarga,$150 miliar,72,Prancis,LVMH
3,4,Bill Gates,$124 miliar,65,Amerika Serikat,Microsoft
4,5,Mark Zuckerberg,$97 miliar,36,Amerika Serikat,Meta Platforms
5,6,Warren Buffett,$96 miliar,90,Amerika Serikat,Berkshire Hathaway
6,7,Larry Ellison,$93 miliar,76,Amerika Serikat,Oracle Corporation
7,8,Larry Page,$91.5 miliar,48,Amerika Serikat,Alphabet Inc.
8,9,Sergey Brin,$89 miliar,47,Amerika Serikat,Alphabet Inc.
9,10,Mukesh Ambani,$84.5 miliar,63,India,Reliance Industries

In [7]:

import re

In [8]:
def is_money_miliar(string_money):
    # akan return True jika terdeteksi data yang berakhiran miliar
    return string_money.lower().endswith("miliar")

In [9]:
def transform_money_format(string_money):
    # mengganti koma menjadi titik dan menghilangkan spasi
    half_clean_string = string_money.lower().replace(",", ".").replace(" ", "")
    # print(half_clean_string)
    # mendeteksi string konsidi(M atau miliar) dan konsidi(J atau juta) dan konsidi(ada string $), kemudian menggantinya dengan string kosong
    return re.sub(r"[?\[M\]miliar|\[J\]juta]|\$", "", half_clean_string)

In [10]:
# Keperluan debugging
s = "$177 miliar"
print(transform_money_format(s))

177

In [11]:
def transform(df, tahun):
    logging.info("Transforming DataFrame ...")

    columns_mapping = {
        "No.": "nomor_urut",
        "Nama": "nama",
        "Kekayaan bersih (USD)": "kekayaan_bersih_usd",
        "Usia": "usia",
        "Kebangsaan":"kebangsaan",
        "Sumber kekayaan":"sumber_kekayaan"
    }

    # mengganti nama2 column sebelumnya sesuai kebutuhan
    renamed_df = df.rename(columns=columns_mapping)

    # menambahkan column tahun dan memberinya value yang berasal dari parameter tahun
    renamed_df["tahun"] = tahun
    
    # Memberi nilai pada kekayaan_bersih_usd_juta dgn percabangan if else
    # Jika terdeteksi string miliar (is_money_miliar), maka dikali 1000 dan string miliar atau juta dihilangkan
    # Jika tidak, maka hanya menghilangkan string juta saja
    renamed_df["kekayaan_bersih_usd_juta"] = renamed_df["kekayaan_bersih_usd"].apply(
        lambda value: float(transform_money_format(value)) * 1000 if is_money_miliar(value) else float(transform_money_format(value))
    )

    return renamed_df[["nomor_urut", "nama","tahun","usia","kebangsaan", "kekayaan_bersih_usd_juta","sumber_kekayaan"]]

In [12]:
'''
# Normal python function
def a_name(x):
    return x+x

# Lambda function
lambda x: x+x
'''

'\n# Normal python function\ndef a_name(x):\n    return x+x\n\n# Lambda function\nlambda x: x+x\n'

In [13]:
df_2021 = transform(dfs, 2021)

INFO:root:Transforming DataFrame ...

In [14]:
df_2021

,nomor_urut,nama,tahun,usia,kebangsaan,kekayaan_bersih_usd_juta,sumber_kekayaan
0,1,Jeff Bezos,2021,57,Amerika Serikat,177000.0,Amazon
1,2,Elon Musk,2021,49,Amerika Serikat,151000.0,"Tesla, SpaceX"
2,3,Bernard Arnault & keluarga,2021,72,Prancis,150000.0,LVMH
3,4,Bill Gates,2021,65,Amerika Serikat,124000.0,Microsoft
4,5,Mark Zuckerberg,2021,36,Amerika Serikat,97000.0,Meta Platforms
5,6,Warren Buffett,2021,90,Amerika Serikat,96000.0,Berkshire Hathaway
6,7,Larry Ellison,2021,76,Amerika Serikat,93000.0,Oracle Corporation
7,8,Larry Page,2021,48,Amerika Serikat,91500.0,Alphabet Inc.
8,9,Sergey Brin,2021,47,Amerika Serikat,89000.0,Alphabet Inc.
9,10,Mukesh Ambani,2021,63,India,84500.0,Reliance Industries

### Practice
Lakukan Cleaning Data seperti diatas

# Storing Data to Database

In [15]:
pip install psycopg2-binary==2.8.6

Requirement already satisfied: psycopg2-binary==2.8.6 in c:\users\ardha\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (2.8.6)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.4; however, version 22.0.3 is available.
You should consider upgrading via the 'C:\Users\ardha\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip' command.

In [16]:
from sqlalchemy import create_engine

In [17]:
# to server (remote DB)
DB_NAME = "postgres"
DB_USER = "user1"
DB_PASSWORD = "user1"
DB_HOST = "104.197.148.144"
DB_PORT = "5432"
CONNECTION_STRING = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
TABLE_NAME = "ardhani-rahmadianto_orang_terkaya_forbes"

In [18]:
CONNECTION_STRING

'postgresql://user1:user1@104.197.148.144:5432/postgres'

In [19]:
def write_to_postgres(df, db_name, table_name, connection_string):
    engine = create_engine(connection_string)
    logging.info(f"Writing dataframe to database: '{db_name}', table: '{table_name}' ...")
    df.to_sql(name = table_name, con=engine, if_exists="replace", index=False)

In [20]:
write_to_postgres(df=df_2021, db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

INFO:root:Writing dataframe to database: 'postgres', table: 'ardhani-rahmadianto_orang_terkaya_forbes' ...

# Read Data from Database

In [21]:
def read_from_postgres(db_name, table_name, connection_string):
    engine = create_engine(connection_string)

    logging.info(f"Reading postgres database: '{db_name}', table: '{table_name}' ...")
    return pd.read_sql_table(table_name, con=engine)

In [22]:
result_df = read_from_postgres(db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

INFO:root:Reading postgres database: 'postgres', table: 'ardhani-rahmadianto_orang_terkaya_forbes' ...

In [23]:
print("Daftar Orang Terkaya di Dunia Menurut Forbes :")
print(result_df.to_string())

Daftar Orang Terkaya di Dunia Menurut Forbes :
   nomor_urut                        nama  tahun  usia       kebangsaan  kekayaan_bersih_usd_juta      sumber_kekayaan
0           1                  Jeff Bezos   2021    57  Amerika Serikat                  177000.0               Amazon
1           2                   Elon Musk   2021    49  Amerika Serikat                  151000.0        Tesla, SpaceX
2           3  Bernard Arnault & keluarga   2021    72          Prancis                  150000.0                 LVMH
3           4                  Bill Gates   2021    65  Amerika Serikat                  124000.0            Microsoft
4           5             Mark Zuckerberg   2021    36  Amerika Serikat                   97000.0       Meta Platforms
5           6              Warren Buffett   2021    90  Amerika Serikat                   96000.0   Berkshire Hathaway
6           7               Larry Ellison   2021    76  Amerika Serikat                   93000.0   Oracle Corporation
7           8                  Larry Page   2021    48  Amerika Serikat                   91500.0        Alphabet Inc.
8           9                 Sergey Brin   2021    47  Amerika Serikat                   89000.0        Alphabet Inc.
9          10               Mukesh Ambani   2021    63            India                   84500.0  Reliance Industries